app/views/users/show.html.erb


<% myevents = Event.where(:host_id => @user.id) %>
---
SELECT "events".* FROM "events" WHERE "events"."host_id" = 1