app/views/events/index.html.erb


	<%= e.name %> is hosted by <%= full_name(User.find(e.host_id)) %>. It's at <%= e.address %>.

---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1