app/views/pages/home.html.erb

SELECT "events".* FROM "events"
SELECT COUNT(*) FROM "events"
---
    	<td>
    		<% if !Event.all.empty? %>