app/controllers/events_controller.rb

	def index
		if params['address'].nil?
			@events = Event.all
---
SELECT events.*, (69.09332411348201 * ABS(events.latitude - 37.635397) * 0.7071067811865475) + (59.836573914187355 * ABS(events.longitude - -121.890543) * 0.7071067811865475) AS distance, CASE WHEN (events.latitude >= 37.635397 AND events.longitude >= -121.890543) THEN 45.0 WHEN (events.latitude < 37.635397 AND events.longitude >= -121.890543) THEN 135.0 WHEN (events.latitude < 37.635397 AND events.longitude < -121.890543) THEN 225.0 WHEN (events.latitude >= 37.635397 AND events.longitude < -121.890543) THEN 315.0 END AS bearing FROM "events" WHERE (events.latitude BETWEEN 37.41829932533373 AND 37.85249467466627 AND events.longitude BETWEEN -122.16468649627747 AND -121.61639950372252) ORDER BY distance ASC

	def create
		@event = Event.new(event_params)
		@event.host_id = params['event']['host_id']

		if @event.save
---
INSERT INTO "events" ("address", "created_at", "max_occup", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "sdf"], ["created_at", Sun, 19 Jan 2014 05:21:10 UTC +00:00], ["max_occup", 234], ["name", "sdfdsf"], ["updated_at", Sun, 19 Jan 2014 05:21:10 UTC +00:00]]